app/Controllers/Criteria.php

INSERT INTO `m_criteria` (`crtr_name`, `status`) VALUES ('tes feb', 'Y')
---
            'status' => 'Y'
        ];
        $criteria = new $this->modelName();
        $criteria->insert($data);